app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cars"
---
    def index
        if current_user.role == "Client"
            @search = Car.ransack(params[:q])
            if params[:q]
            @cars = @search.result.page(params[:page])

INSERT INTO "cars" ("name", "age", "color", "price", "power", "weight", "speed", "size", "picture", "created_at", "updated_at", "comment", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
    def create
        @car = Car.new(car_params)
        @car.user_id = current_user.id
        if @car.save

UPDATE "cars" SET "weight" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["weight", 571], ["updated_at", "2021-09-17 14:00:24.657744"], ["id", 3]]
---
    def update
        if @car.update(car_params)