app/controllers/comments_controller.rb

  def create
    @car = Car.find(params[:car_id])
    @comment = @car.comments.build(comment_params)
    respond_to do |format|
      if @comment.save
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("car_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["car_id", 1], ["comment", "high quality"], ["created_at", "2021-09-20 15:06:00.523461"], ["updated_at", "2021-09-20 15:06:00.523461"]]