app/controllers/users_controller.rb

  def index

    @search = User.ransack(params[:q])
    if params[:q]
    @users = @search.result.page(params[:page])
---
SELECT COUNT(*) FROM "users"