app/views/cars/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."car_id" = $1  [["car_id", 2]]
---
  List of Comments:
  <% if @car.comments.count > 0 %>